package ru.zapashnii.rickandmorty.di

import dagger.Binds
import dagger.Module
import dagger.Reusable

/**  Dagger модуль для связывания интрефейсов с их реализациями уровня приложения */
@Module
interface AppBindsModule {
    /*
     * --------------------------------
     * Бинды для сервисов
     * --------------------------------
     */


    /*
     * --------------------------------
     * Бинды для репозиториев
     * --------------------------------
     */


    /*
     * --------------------------------
     * Бинды для интеракторов (UseCase)
     * --------------------------------
     */

}